Autodesk.Revit.DB.Architecture.WinderPathResult
Flag indicates whether curves are valid to use as base lines for winder path.
Since:
2013

Autodesk.Revit.DB.Architecture.WinderPathResult.NotSupported
This path(for zigzag winder) is not supported yet

Autodesk.Revit.DB.Architecture.WinderPathResult.InvalidCurveType
Curve is not line.

Autodesk.Revit.DB.Architecture.WinderPathResult.SelfIntersect
The first curve intersect with third curve.

Autodesk.Revit.DB.Architecture.WinderPathResult.ColinearOrOverlap
Two curves are collinear or overlap.

Autodesk.Revit.DB.Architecture.WinderPathResult.TooShort
Curve length is too short.

Autodesk.Revit.DB.Architecture.WinderPathResult.NotOpenLoop
The curves are not in one open loop.

Autodesk.Revit.DB.Architecture.WinderPathResult.Noncontinuous
The curves are not continuous in one loop.

Autodesk.Revit.DB.Architecture.WinderPathResult.Unbound
Curve is not bound.

Autodesk.Revit.DB.Architecture.WinderPathResult.NumberOutOfRange
The curves number is not 2 or 3.

Autodesk.Revit.DB.Architecture.WinderPathResult.Success
Indicates curves are valid to use as path base lines for winder run.
This is only one flag indicates curves are fine to use as winder path.